      ******************************************************************
      * CPYBALHV - Host variables para DB2 (CURSOR)
      ******************************************************************
       01  HV.
           05 HV-ACCT-ID              PIC X(12).

           05 HV-BAL-DATE-CHAR        PIC X(10).  
           05 HV-CCY                  PIC X(3).

           05 HV-CURR-BAL             PIC S9(13)V99 COMP-3.
           05 HV-AVAIL-BAL            PIC S9(13)V99 COMP-3.
