//MPBALRUN JOB (ACCT),'SALDOS',CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID
//STEP1    EXEC PGM=IKJEFT01,DYNAMNBR=20,REGION=0M
//STEPLIB  DD  DISP=SHR,DSN=DSN!!0.SDSNLOAD
//         DD  DISP=SHR,DSN=DSN!!0.SDSNEXIT
//         DD  DISP=SHR,DSN=TU.LOADLIB.DE.MPBALQRY
//SYSTSPRT DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//SYSTSIN  DD  *
  DSN SYSTEM(DB2SSID)
  RUN PROGRAM(MPBALQRY) PLAN(PLANBAL) -
      LIB('TU.LOADLIB.DE.MPBALQRY')
  END
/*
//INFILE   DD  DISP=SHR,DSN=TU.INPUT.CUENTAS
//OUTFILE  DD  DISP=(NEW,CATLG,DELETE),
//             DSN=TU.OUTPUT.REPORTE.SALDOS,
//             SPACE=(TRK,(5,5),RLSE),
//             DCB=(RECFM=FB,LRECL=140,BLKSIZE=0)
